import math

"""
Константи:

math.pi - константа π (приблизно 3.14159...);
math.e - константа e, основа натуральних логарифмів (приблизно 2.71828...);
math.tau - константа τ, дорівнює 2π (приблизно 6.28318...);
math.inf - позначення нескінченності;
math.nan - позначення 'Not a Number' (не число);


Функції округлення чисел:

math.ceil(x) - виконує округлення дійсного числа x до найближчого більшого цілого числа;
math.floor(x) - виконує округлення дійсного числа x до найближчого меншого цілого числа;
math.trunc(x) - виконує обрізання дробової частини дійсного числа x, та повертає цілу частину числа;

"""

# Вихідне число
x = 3.7

# Використання різних методів округлення
ceil_result = math.ceil(x)  # Округлення вгору
floor_result = math.floor(x)  # Округлення вниз
trunc_result = math.trunc(x)  # Відсікання дробової частини

print(ceil_result, floor_result, trunc_result)


"""
Тригонометричні функції

math.sin(x) - синус x, де x в радіанах;
math.cos(x) - косинус x;
math.tan(x) - тангенс x;
math.asin(x) - арксинус x;
math.acos(x) - арккосинус x;
math.atan(x) - арктангенс x;


Експоненційні та логарифмічні функції

math.exp(x) - число e в ступені x;
math.log(x[, base]) - Логарифм x за основою base. Якщо base не вказано, обчислюється натуральний логарифм;


Ступінь та корінь

math.pow(x, y) - x у ступені y;
math.sqrt(x) - квадратний корінь з x;


Деякі інші функції

math.fabs(x) - модуль (абсолютне значення) x;
math.factorial(x) - факторіал числа x;
math.gcd(x, y) - найбільший спільний дільник для x та y;

"""

# Використання констант
print(math.pi)  # Виведе приблизне значення π

# Тригонометрія
angle = math.radians(60)  # Конвертація з градусів у радіани
print(math.sin(angle))  # Синус кута

# Корінь числа
print(math.sqrt(9))  # Квадратний корінь з 9

# Логарифми
print(math.log(10, 2))  # Логарифм 10 за основою 2



# Функція math.isclose використовується для порівняння двох чисел 
# з певною допустимою похибкою. Це корисно для порівняння
#  дійсних чисел, де пряме порівняння може бути ненадійним.

print(0.1 + 0.2 == 0.3)  # Це повертає False

r = math.isclose(0.1 + 0.2, 0.3)
print(r)  # Це поверне True
